notes/20211120220855-lagrangiana.tex
% Created 2021-11-20 sáb 22:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tikz}
\author{Edgard Macena}
\date{\today}
\title{Lagrangiana}
\hypersetup{
 pdfauthor={Edgard Macena},
 pdftitle={Lagrangiana},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Resumo}
\label{sec:orgeddcf4e}
Vimos nas aulas anteriores que a análise do princío de Hamilton fornecia as equações de movimento em qualquer coordenadas

Vimos ainda que para a equação

\begin{equation}
  L = T - V
\end{equation}

Obtemos, através de Euler-Lagrange

\begin{equation}\label{eq:Euler-Lagrange}
\frac{\mathrm{d}L}{\mathrm{d}\mathbf{r}} - \frac{\mathrm{d}}{\mathrm{d}t}\left(\dfrac{\partial L}{\partial \mathbf{\dot{r}}}\right) = 0
\end{equation}

Nos fornece as equações do momento e força generalizados (angular e linear)
Façamos um resumo sobre quando devemos usar multiplicadores de Lagrange no
formalismo Lagrangiano

O ponto de partida deve ser observar que o formalismo de lagrange está
baseado no princípio de Hamilton. Por sua vez, vimos que se não há vínculos
entre as coordenadas e o movimento, podemos aplicar de maneira simples Euler
Lagrange. Se houver vínculos

Portano, vemos que o uso de multiplicadores de Lagrange depende do funcional
L (Lagrangiano) ser função de variáveis que tem vínculos entre si.

Podemos ainda generalizar o que vimos até agora para \emph{N} párticulas

Tendo a revisão feita, vamos partir pra generalização para qualquer
coordenada.


\section{Coordenadas generalizadas e graus de liberdade}
\label{sec:org880bb42}
Dizemos que \(q_1, q_2, ..., q_n\) é um conjunto de \emph{coordenadas generalizadas} se
a posição de toda partícula do sistema é uma função dessas variáveis

\begin{equation}\label{eq:coordenadas generalizadas}
\mathbf{r_i} = \mathbf{r_i}(q_1, q_2, ..., q_n)
\end{equation}

em que \(\mathbf{r_i}\) é a i-ésima coordenada

\begin{itemize}
\item Pendulo simples
\(\mathbf{r} = \mathbf{r}(x,y)\)

\(\mathbf{r} = \mathbf{r}(\theta)\)

São ambas coordenadas generalizadas de \(\mathbf{r}\)
\end{itemize}

O número de graus de liberdade de um sistema é dado pelo número de
coordenadas que podem variar independentemente

Se o número de coordenadas generalizadas é igual ao de graus de liberdade, o
conjunto é chamado de próprio
\subsection{Outras definições}
\label{sec:org79fa48f}
\begin{itemize}
\item Sistema holonômico:
Sistema no qual as equações de vínculo podem ser usadas pra eliminar
algumas coordenadas, reduzindo-se o número total de coordenadas. Vinculos
do tipo \(g(\{q_i\},t = 0)\) são holonômicos
\item Sistema forçado
Se a eliminação de coordenadas introduzir funções explícitoas do tempo, o
sistema é dito forçado, se os vínculos são tais que que \(\mathbf{r}\)
não depende explicitamente de \(t\), o sistema é dito \textbf{natural}

Se o sistema for natural, \(T\) é a soma de das energias cinéticas devido as
energias cinéticas generalizadas, apenas com termos quadráticos.
\end{itemize}

Vamos agora determinar as equações de movimento em termos de coordenadas
generalizadas.

Se \(\{q_i\}\) for um conjunto próprio, e o sistema tiver \(s\) \uline{graus de liberdade}

  \begin{equation}
equação
  \end{equation}

Obtivemos tal resultado considerando:
\begin{enumerate}
\item As forças consideradas até agora são todas conservativas ou de vínculo
\item Os vínculos usados até aqui são todos holonômicos
\end{enumerate}

\section{Leis de conservação}
\label{sec:org8fb6461}
Observe que se uma coordenada própria não aparecer explicitamente na
lagrangiana, equação para essa coordenada sera

  \begin{equation}
\frac{\partial L}{\partial q_{\alpha}} - \frac{d}{dt}\left(\frac{\partial L}{\partial \dot{q}_{\alpha}} \right) = 0
  \end{equation}

Temos então
 \begin{equation}
\frac{d}{dt}\left(\frac{\partial L}{\partial \dot{q}_{\alpha}}\right) = 0
 \end{equation}
Que é uma constante do movimento
\end{document}